{
    "chapters": [
        {
            "chapterNumber": 1,
            "chapterTitle": "The Pairs",
            "verses": [
                {
                    "verseNumber": 1,
                    "verseText": "All mental phenomena have mind as their forerunner; they have mind as their chief; they are mind-made. If one speaks or acts with an evil mind, 'dukkha' follows him just as the wheel follows the hoofprint of the ox that draws the cart."
                },
                {
                    "verseNumber": 2,
                    "verseText": "All mental phenomena have mind as their forerunner; they have mind as their chief; they are mind-made. If one speaks or acts with a pure mind, happiness (sukha) follows him like a shadow that never leaves him."
                },
                {
                    "verseNumber": 3,
                    "verseText": "\"He abused me, he ill-treated me, he got the better of me, he stole my belongings;\"... the enmity of those harbouring such thoughts cannot be appeased."
                },
                {
                    "verseNumber": 4,
                    "verseText": "\"He abused me, he ill-treated me, he got the better of me, he stole my belongings;\"... the enmity of those not harbouring such thoughts can be appeased."
                },
                {
                    "verseNumber": 5,
                    "verseText": "Hatred is, indeed, never appeased by hatred in this world. It is appeased only by loving-kindness. This is an ancient law."
                },
                {
                    "verseNumber": 6,
                    "verseText": "People, other than the wise, do not realize, \"We in this world must all die,\" (and, not realizing it, continue their quarrels). The wise realize it and thereby their quarrels cease."
                },
                {
                    "verseNumber": 7,
                    "verseText": "He who keeps his mind on pleasant objects, who is uncontrolled in his senses, immoderate in his food, and is lazy and lacking in energy, will certainly be overwhelmed by Mara, just as stormy winds uproot a weak tree."
                },
                {
                    "verseNumber": 8,
                    "verseText": "He who keeps his mind on the impurities (of the body), who is well-controlled in his senses and is full of faith and energy, will certainly be not overwhelmed by Mara, just as stormy winds cannot shake a mountain of rock."
                },
                {
                    "verseNumber": 9,
                    "verseText": "He who is not free from taints of moral defilements (kilesas) and yet dons the yellow robe, who lacks restraint in his senses and (speaks not the) truth is unworthy of the yellow robe."
                },
                {
                    "verseNumber": 10,
                    "verseText": "He who has discarded all moral defilements (kilesas), who is established in moral precepts, is endowed with restraint and (speaks the) truth is, indeed, worthy of the yellow robe."
                },
                {
                    "verseNumber": 11,
                    "verseText": "They take untruth for truth; they take truth for untruth; such persons can never arrive at the truth, for they hold wrong views."
                },
                {
                    "verseNumber": 12,
                    "verseText": "They take truth for truth; they take untruth for untruth; such persons arrive at the truth, for they hold right views."
                },
                {
                    "verseNumber": 13,
                    "verseText": "Just as rain penetrates a badly-roofed house, so also, passion (raga) penetrates a mind not cultivated in Tranquillity and Insight Development (Samatha and Vipassana)."
                },
                {
                    "verseNumber": 14,
                    "verseText": "Just as rain cannot penetrate a well-roofed house, so also, passion (raga) cannot penetrate a mind well-cultivated in Tranquillity and Insight Development (Samatha and Vipassana)."
                },
                {
                    "verseNumber": 15,
                    "verseText": "Here he grieves, hereafter he grieves; the evil-doer grieves in both existences. He grieves and he suffers anguish when he sees the depravity of his own deeds."
                },
                {
                    "verseNumber": 16,
                    "verseText": "Here he rejoices, hereafter he rejoices; one who performed meritorious deeds rejoices in both existences. He rejoices and greatly rejoices when he sees the purity of his own deeds."
                },
                {
                    "verseNumber": 17,
                    "verseText": "Here he is tormented, hereafter he is tormented; the evil-doer is tormented in both existences. He is tormented, and he laments: \"Evil have I done.\" He is even more tormented when he is reborn in one of the lower worlds (Apaya)."
                },
                {
                    "verseNumber": 18,
                    "verseText": "Here he is happy, hereafter he is happy; one who performs meritorious deeds is happy in both existences. Happily he exclaims: \"I have done meritorious deeds.\" He is happier still when he is reborn in a higher world (suggati)."
                },
                {
                    "verseNumber": 19,
                    "verseText": "Though he recites much the Sacred Texts (Tipitaka), but is negligent and does not practise according to the Dhamma, like a cowherd who counts the cattle of others, he has no share in the benefits of the life of a bhikkhu (i.e., Magga-phala)."
                },
                {
                    "verseNumber": 20,
                    "verseText": "Though he recites only a little of the Sacred Texts (Tipitaka), but practises according to the Dhamma, eradicating passion, ill will and ignorance, clearly comprehending the Dhamma, with his mind freed from moral defilements and no longer clinging to this world or to the next, he shares the benefits of the life of a bhikkhu (i.e., Magga-phala)."
                }
            ]
        },
        {
            "chapterNumber": 2,
            "chapterTitle": "Mindfulness",
            "verses": [
                {
                    "verseNumber": 21,
                    "verseText": "Mindfulness is the way to the Deathless (Nibbana); unmindfulness is the way to Death. Those who are mindful do not die; those who are not mindful are as if already dead."
                },
                {
                    "verseNumber": 22,
                    "verseText": "Fully comprehending this, the wise, who are mindful, rejoice in being mindful and find delight in the domain of the Noble Ones (Ariyas)."
                },
                {
                    "verseNumber": 23,
                    "verseText": "The wise, constantly cultivating Tranquillity and Insight Development Practice, being ever mindful and steadfastly striving, realize Nibbana: Nibbana, which is free from the bonds of yoga*; Nibbana, the Incomparable!"
                },
                {
                    "verseNumber": 24,
                    "verseText": "If a person is energetic, mindful, pure in his thought, word and deed, and if he does every thing with care and consideration, restrains his senses, earns his living according to the Law (Dhamma) and is not unheedful, then, the fame and fortune of that mindful person steadily increase."
                },
                {
                    "verseNumber": 25,
                    "verseText": "Through diligence, mindfulness, discipline (with regard to moral precepts), and control of his senses, let the man of wisdom make (of himself) an island which no flood can overwhelm."
                },
                {
                    "verseNumber": 26,
                    "verseText": "The foolish and the ignorant give themselves over to negligence; whereas the wise treasure mindfulness as a precious jewel."
                },
                {
                    "verseNumber": 27,
                    "verseText": "Therefore, one should not be negligent, nor be addicted to sensual pleasures; for he who is established in mindfulness, through cultivation of Tranquillity and Insight Development Practice, experiences supreme happiness (i.e., realizes Nibbana)."
                },
                {
                    "verseNumber": 28,
                    "verseText": "The wise one dispels negligence by means of mindfulness; he ascends the pinnacle of wisdom and being free from sorrow looks at the sorrowing beings. Just as one on the mountain top looks at those on the plain below, so also, the wise one (the arahat) looks at the foolish and the ignorant (worldlings)."
                },
                {
                    "verseNumber": 29,
                    "verseText": "Mindful amongst the negligent, highly vigilant amongst the drowsy, the man of wisdom advances like a race-horse, leaving the jade behind."
                },
                {
                    "verseNumber": 30,
                    "verseText": "Through mindfulness (in doing meritorious deeds) Magha became king of the devas. Mindfulness is always praised, but negligence is always blamed."
                },
                {
                    "verseNumber": 31,
                    "verseText": "A bhikkhu who takes delight in mindfulness and sees danger in negligence, advances like fire, burning up all fetters, great and small."
                },
                {
                    "verseNumber": 32,
                    "verseText": "A bhikkhu who takes delight in mindfulness and sees danger in negligence will not fall away*, he is, indeed, very close to Nibbana."
                }
            ]
        },
        {
            "chapterNumber": 3,
            "chapterTitle": "The Mind",
            "verses": [
                {
                    "verseNumber": 33,
                    "verseText": "The mind is excitable and unsteady; it is difficult to control and to restrain. The wise one trains his mind to be upright as a fletcher straightens an arrow."
                },
                {
                    "verseNumber": 34,
                    "verseText": "As a fish quivers when taken out of its watery home and thrown on to dry ground, so does the mind quiver when it is taken out of the sensual world to escape from the realm of Mara (i.e., kilesa vatta, round of moral defilements)."
                },
                {
                    "verseNumber": 35,
                    "verseText": "The mind is difficult to control; swiftly and lightly, it moves and lands wherever it pleases. It is good to tame the mind, for a well-tamed mind brings happiness."
                },
                {
                    "verseNumber": 36,
                    "verseText": "The mind is very difficult to see, very delicate and subtle; it moves and lands wherever it pleases. The wise one should guard his mind, for a guarded mind brings happiness."
                },
                {
                    "verseNumber": 37,
                    "verseText": "The mind wanders far and moves about alone: it is non-material; it lies in the cave (chamber) of the heart. Those who control their mind will be free from the bonds of Mara."
                },
                {
                    "verseNumber": 38,
                    "verseText": "If a man's mind is unsteady, if he is ignorant of the true Dhamma, and if his faith is wavering, then his knowledge will never be perfect."
                },
                {
                    "verseNumber": 39,
                    "verseText": "If a man's mind is free from passion, if he is free from ill will, if he has abandoned both good and evil, and if he is vigilant, for such a man there is no danger."
                },
                {
                    "verseNumber": 40,
                    "verseText": "Knowing that this body is (fragile) like an earthern jar, making one's mind secure like a fortified town, one should fight Mara with the weapon of Knowledge. (After defeating Mara) one should still continue to guard one's mind, and feel no attachment to that which has been gained (i.e., jhana ecstasy and serenity gained through meditation)."
                },
                {
                    "verseNumber": 41,
                    "verseText": "Before long, alas, this body, deprived of consciousness, will lie on the earth, discarded like a useless log."
                },
                {
                    "verseNumber": 42,
                    "verseText": "A thief may harm a thief; an enemy may harm an enemy; but a wrongly directed mind can do oneself far greater harm."
                },
                {
                    "verseNumber": 43,
                    "verseText": "Not a mother, nor a father, nor any other relative can do more for the well-being of one than a rightly-directed mind can."
                }
            ]
        },
        {
            "chapterNumber": 4,
            "chapterTitle": "Flowers",
            "verses": [
                {
                    "verseNumber": 44,
                    "verseText": "Who shall examine this earth (i.e., this body)' the world of Yama (i.e., the four Apayas) and the world of man together with the world of devas? Who shall examine the well-taught Path of Virtue (Dhammapada) as an expert florist picks and chooses flowers?"
                },
                {
                    "verseNumber": 45,
                    "verseText": "The Ariya Sekha* shall examine this earth (i.e., the body), the world of Yama (i.e., the four Apayas) and the world of man together with the world of devas. The Ariya Sekha shall examine the well-taught Path of Virtue (Dhammapada) as an expert florist picks and chooses flowers."
                },
                {
                    "verseNumber": 46,
                    "verseText": "One who knows that this body is impermanent like froth, and comprehends that it is insubstantial like a mirage will cut the flowers of Mara (i.e., the three kinds of vatta or rounds), and pass out of sight of the King of Death."
                },
                {
                    "verseNumber": 47,
                    "verseText": "Like one who picks and chooses flowers, a man who has his mind attached to sensual pleasures is carried away by Death, just as a great flood sweeps away a sleeping village."
                },
                {
                    "verseNumber": 48,
                    "verseText": "Like one who picks and chooses flowers, a man who has his mind attached to sensual pleasures and is insatiate in them is over powered by Death."
                },
                {
                    "verseNumber": 49,
                    "verseText": "As the bee collects nectar and flies away without damaging the flower or its colour or its scent, so also, let the bhikkhu dwell and act in the village (without affecting the faith and generosity or the wealth of the villagers)."
                },
                {
                    "verseNumber": 50,
                    "verseText": "One should not consider the faults of others, nor their doing or not doing good or bad deeds. One should consider only whether one has done or not done good or bad deeds."
                },
                {
                    "verseNumber": 51,
                    "verseText": "Just as a beautiful flower, lacking in scent, cannot give the wearer the benefit of its scent, so also, the well-preached words of the Buddha cannot benefit one who does not practise the Dhamma."
                },
                {
                    "verseNumber": 52,
                    "verseText": "Just as a flower, beautiful as well as fragrant, will give the wearer the benefit of its scent, so also, the well-preached words of the Buddha will benefit one who practises the Dhamma."
                },
                {
                    "verseNumber": 53,
                    "verseText": "As from a collection of flowers many a garland can be made by an expert florist, so also, much good can be done (with wealth, out of faith and generosity) by one subject to birth and death."
                },
                {
                    "verseNumber": 54,
                    "verseText": "The scent of flowers cannot go against the wind; nor the scent of sandalwood, nor of rhododendron (tagara), nor of jasmin (mallika); only the reputation of good people can go against the wind. The reputation of the virtuous ones (sappurisa) is wafted abroad in all directions."
                },
                {
                    "verseNumber": 55,
                    "verseText": "There are the scents of sandalwood, rhododendron, lotus and jasmin (vassika); but the scent of virtue surpasses all scents."
                },
                {
                    "verseNumber": 56,
                    "verseText": "The scents of rhododendron and of sandal wood are very faint; but the scent (reputation) of the virtuous is the strongest; it spreads even to the abodes of the deva."
                },
                {
                    "verseNumber": 57,
                    "verseText": "Mara cannot find the path taken by those who are endowed with virtue, who live mindfully and have been freed from moral defilements by Right Knowledge."
                },
                {
                    "verseNumber": [58, 59],
                    "verseText": "As a sweet-smelling and beautiful lotus flower may grow upon a heap of rubbish thrown on the highway, so also, out of the rubbish heap of beings may appear a disciple of the Buddha, who with his wisdom shines forth far above the blind (ignorant) worldlings."
                }
            ]
        },
        {
            "chapterNumber": 5,
            "chapterTitle": "The Fool",
            "verses": [
                {
                    "verseNumber": 60,
                    "verseText": "Long is the night to one who is wakeful; long is (the journey of) one yojana to the traveller who is tired; long is samsara (round of rebirths) to the fool, who is ignorant of the true Dhamma (the Teaching of the Buddha)."
                },
                {
                    "verseNumber": 61,
                    "verseText": "If a person seeking a companion cannot find one who is better than or equal to him, let him resolutely go on alone; there can be no companionship with a fool."
                },
                {
                    "verseNumber": 62,
                    "verseText": "\"I have sons, I have wealth\"; with this (feeling of attachment) the fool is afflicted. Indeed, he himself is not his own, how can sons and wealth be his?"
                },
                {
                    "verseNumber": 63,
                    "verseText": "The fool who knows that he is a fool can, for that reason, be a wise man; but the fool who thinks that he is wise is, indeed, called a fool."
                },
                {
                    "verseNumber": 64,
                    "verseText": "A fool, even though he is associated with a wise man all his life, does not understand the Dhamma, just as a ladle does not know the taste of soup."
                },
                {
                    "verseNumber": 65,
                    "verseText": "An intelligent man, even though he is associated with a wise man only for a moment, quickly understands the Dhamma, just as the tongue knows the taste of soup."
                },
                {
                    "verseNumber": 66,
                    "verseText": "With themselves as their own enemies, fools lacking in intelligence, move about doing evil deeds, which bear bitter fruits."
                },
                {
                    "verseNumber": 67,
                    "verseText": "That deed is not well done, if one has to repent for having done it, and if, with a tearful face, one has to weep as a result of that deed."
                },
                {
                    "verseNumber": 68,
                    "verseText": "That deed is well done if one has not to repent for having done it, and if one is delightful and happy with the result of that deed."
                },
                {
                    "verseNumber": 69,
                    "verseText": "As long as the evil deed does not bear fruit, the fool thinks it is sweet like honey; but when his evil deed does bear fruit, the fool suffers for it."
                },
                {
                    "verseNumber": 70,
                    "verseText": "Even though, month after month, the fool (living in austerity) takes his food sparingly with the tip of a grass blade, he is not worth even one-sixteenth part of those who have comprehended the Truth (i.e., the ariyas)."
                },
                {
                    "verseNumber": 71,
                    "verseText": "An evil deed does not immediately bear fruit, just as the newly-drawn milk does not curdle at once; but it follows the fool burning him like live coal covered with ashes."
                },
                {
                    "verseNumber": 72,
                    "verseText": "The skill of a fool can only harm him; it destroys his merit and his wisdom (lit., it severs his head)."
                },
                {
                    "verseNumber": 73,
                    "verseText": "The foolish bhikkhu desires praise for qualities he does not have, precedence among bhikkhus, authority in the monasteries, and veneration from those unrelated to him."
                },
                {
                    "verseNumber": 74,
                    "verseText": "\"Let both laymen and bhikkhus think that things are done because of me; let them obey me in all matters, great and small.\" Such being the thoughts of the fool, his greed and his pride grow."
                }
                ,
                {
                    "verseNumber": 75,
                    "verseText": "Indeed, the path that leads to worldly gain is one and the Path that leads to Nibbana is another. Fully comprehending this, the bhikkhu, the disciple of the Buddha, should not take delight in worldly gain and honour, but devote himself to solitude, detachment and the realization of Nibbana."
                }
            ]
        },
        {
            "chapterNumber": 6,
            "chapterTitle": "The Wise",
            "verses": [
                {
                    "verseNumber": 76,
                    "verseText": "One should follow a man of wisdom who rebukes one for one's faults, as one would follow a guide to some buried treasure. To one who follows such a wise man, it will be an advantage and not a disadvantage."
                },
                {
                    "verseNumber": 77,
                    "verseText": "The man of wisdom should admonish others; he should give advice and should prevent others from doing wrong; such a man is held dear by the good; he is disliked only by the bad."
                },
                {
                    "verseNumber": 78,
                    "verseText": "One should not associate with bad friends, nor with the vile. One should associate with good friends, and with those who are noble."
                },
                {
                    "verseNumber": 79,
                    "verseText": "He who drinks in the Dhamma lives happily with a serene mind; the wise man always takes delight in the Dhamma (Bodhipakkhiya Dhamma) expounded by the Noble Ones (ariyas)."
                },
                {
                    "verseNumber": 80,
                    "verseText": "Farmers (lit., makers of irrigation canals) channel the water; fletchers straighten the arrow; carpenters work the timber; the Wise tame themselves."
                },
                {
                    "verseNumber": 81,
                    "verseText": "As a mountain of rock is unshaken by wind, so also, the wise are unperturbed by blame or by praise."
                },
                {
                    "verseNumber": 82,
                    "verseText": "Like a lake which is deep, clear and calm, the wise after listening to the Teaching (Dhamma) become serene."
                },
                {
                    "verseNumber": 83,
                    "verseText": "Indeed, the virtuous give up all (i.e., attachment to the five khandhas, etc.); the virtuous (lit., the tranquil) do not talk with sensual desire; when faced with joy or sorrow, the wise do not show elation or depression."
                },
                {
                    "verseNumber": 84,
                    "verseText": "For his own sake or for the sake of others, he does no evil; nor does he wish for sons and daughters or for wealth or for a kingdom by doing evil; nor does he wish for success by unfair means; such a one is indeed virtuous, wise and just."
                },
                {
                    "verseNumber": 85,
                    "verseText": "Few among men reach the other shore (Nibbana); all the others only run up and down on this shore."
                },
                {
                    "verseNumber": 86,
                    "verseText": "But those who practise according to the well-expounded Dhamma will reach the other shore (Nibbana), having passed the realm of Death (i.e., samsara), very difficult as it is to cross."
                },
                {
                    "verseNumber": [87, 88],
                    "verseText": "The man of wisdom, leaving the home of craving and having Nibbana as his goal, should give up dark, evil ways and cultivate pure, good ones. He should seek great delight in solitude, detachment and Nibbana, which an ordinary man finds so difficult to enjoy. He should also give up sensual pleasures, and clinging to nothing, should cleanse himself of all impurities of the mind."
                },
                {
                    "verseNumber": 89,
                    "verseText": "Those, with mind well-developed in the seven Factors of Enlightenment (bojjhanga), having rid themselves of all craving, rejoice in their abandonment of attachment. Such men, with all moral intoxicants eradicated, and powerful (with the light of Arahatta Magganana), have realized Nibbana in this world (i.e., with Khandha aggregates remaining)."
                }
            ]
        },
        {
            "chapterNumber": 7,
            "chapterTitle": "The Arahat",
            "verses": [
                {
                    "verseNumber": 90,
                    "verseText": "For him (an arahat) whose journey is ended, who is free from sorrow and from all (e.g. khandha aggregates), who has destroyed all fetters, there is no more distress."
                },
                {
                    "verseNumber": 91,
                    "verseText": "The mindful strive diligently (in the Tranquillity and Insight Development Practice); they take no delight in the home (i.e., in the life of sensual pleasures); like swans (hamsa) that forsake the muddy pool, they abandon all home life (i.e., all cravings)."
                },
                {
                    "verseNumber": 92,
                    "verseText": "Arahats do not hoard (anything); when taking food they reflect well over it (i.e., in accordance with the three parinnas).* They have as their object liberation from existence, that is, Nibbana which is Void and Signless. Their destination, like the course of birds in the air, cannot be traced."
                },
                {
                    "verseNumber": 93,
                    "verseText": "The arahat is free from moral intoxicants (asavas); he is not attached to food. He has as his object liberation from existence, i.e., Nibbana which is Void and Signless. His path, like that of birds in the air, cannot be traced."
                },
                {
                    "verseNumber": 94,
                    "verseText": "The arahat whose sense-faculties are calm like horses well-tamed by the charioteer, who is free from pride and moral intoxicants - such an arahat is held dear even by the devas."
                },
                {
                    "verseNumber": 95,
                    "verseText": "Like the earth, the arahat is patient and is not provoked to respond in anger; like the door-post he is firm; he is unperturbed by the ups and downs of life; he is serene and pure like a lake free from mud. For such an arahat there will be no more rebirth."
                },
                {
                    "verseNumber": 96,
                    "verseText": "An arahat is calm in his mind, calm in his speech, and also in his deed; truly knowing the Dhamma, such an arahat is free from moral defilements and is unpurturbed by the ups and downs of life."
                },
                {
                    "verseNumber": 97,
                    "verseText": "He who is not credulous, who has realized the Unconditioned (Nibbana), who has cut off the links of the round of rebirths, who has destroyed all consequences of good and bad deeds, who has discarded all craving, is indeed the noblest of all men (i.e., an arahat)."
                },
                {
                    "verseNumber": 98,
                    "verseText": "In a village or in a forest, in a valley or on a hill, wherever arahats dwell, that place is delightful."
                },
                {
                    "verseNumber": 99,
                    "verseText": "Forests are delightful, but the worldlings find no delight in them; only those who are free from passion will find delight in them, for they do not seek sensual pleasures."
                }
            ]
        },
        {
            "chapterNumber": 8,
            "chapterTitle": "The Thousand",
            "verses": [
                {
                    "verseNumber": 100,
                    "verseText": "Better than a thousand words that are senseless and unconnected with the realization of Nibbana, is a single word of sense, if on hearing it one is calmed."
                },
                {
                    "verseNumber": 101,
                    "verseText": "Better than a thousand verses that are senseless and unconnected with the realization of Nibbana, is a single verse, if on hearing it one is calmed."
                },
                {
                    "verseNumber": 102,
                    "verseText": "Better than the recitation of a hundred verses that are senseless and unconnected with the realization of Nibbana, is the recitation of a single verse of the Teaching (Dhamma), if on hearing it one is calmed."
                },
                {
                    "verseNumber": 103,
                    "verseText": "A man may conquer a million men in battle, but one who conquers himself is, indeed, the greatest of conquerors."
                },
                {
                    "verseNumber": [104, 105],
                    "verseText": "It is better indeed, to conquer oneself than to conquer others. Neither a deva, nor a gandhabba, nor Mara together with Brahma can turn into defeat the victory of the man who controls himself."
                },
                {
                    "verseNumber": 106,
                    "verseText": "Month after month for a hundred years, one may make offerings (to ordinary people) to the value of a thousand Kahapanas; yet if, only for a moment one pays homage to a bhikkhu who has practised Insight Development, this homage is, indeed, better than a hundred years of making offerings (to ordinary people)."
                },
                {
                    "verseNumber": 107,
                    "verseText": "For a hundred years, a man may tend the sacred fire in the forest: yet if, only for a moment, one pays homage to a bhikkhu who has practised Insight Development, this homage is, indeed, better than a hundred years of making sacrifices (in fire-worship)."
                },
                {
                    "verseNumber": 108,
                    "verseText": "In this world, one may make sacrificial offerings, great and small, all the year round, in order to gain merit; all these offerings are not worth a quarter of the merit gained by worshipping the Noble Ones (Ariyas) who walk the right path."
                },
                {
                    "verseNumber": 109,
                    "verseText": "For one who always respects and honours those who are older and more virtuous, four benefits, viz., longevity, beauty, happiness and strength, will increase."
                },
                {
                    "verseNumber": 110,
                    "verseText": "Better than a hundred years in the life of an immoral person who has no control over his senses, is a day in the life of a virtuous person who cultivates Tranquillity and Insight Development Practice."
                },
                {
                    "verseNumber": 111,
                    "verseText": "Better than a hundred years in the life of an ignorant person, who has no control over his senses, is a day in the life of a wise man who cultivates Tranquillity and Insight Development Practice."
                },
                {
                    "verseNumber": 112,
                    "verseText": "Better than a hundred years in the life of a person who is idle and inactive, is a day in the life of one who makes a zealous and strenuous effort (in Tranquillity and Insight Development Practice)."
                },
                {
                    "verseNumber": 113,
                    "verseText": "Better than a hundred years in the life of a person who does not perceive the arising and the dissolving of the five aggregates (khandhas), is a day in the life of one who perceives the arising and dissolving of the five aggregates."
                },
                {
                    "verseNumber": 114,
                    "verseText": "Better than a hundred years in the life of a person who does not perceive the Deathless (Nibbana), is a day in the life of one who perceives the Deathless (Nibbana)."
                },
                {
                    "verseNumber": 115,
                    "verseText": "Better than a hundred years in the life of a person who does not comprehend the Noble Dhamma (Dhammamuttamam), is a day in the life of one who comprehends the Noble Dhamma."
                }
            ]
        },
        {
            "chapterNumber": 9,
            "chapterTitle": "Evil",
            "verses": [
                {
                    "verseNumber": 116,
                    "verseText": "One should make haste in doing good deeds; one should restrain one's mind from evil; for the mind of one who is slow in doing good tends to take delight in doing evil."
                },
                {
                    "verseNumber": 117,
                    "verseText": "If a man does evil, he should not do it again and again; he should not take delight in it; the accumulation of evil leads to dukkha."
                },
                {
                    "verseNumber": 118,
                    "verseText": "If a man does what is good, he should do it again and again; he should take delight in it; the accumulation of merit leads to happiness."
                },
                {
                    "verseNumber": 119,
                    "verseText": "Even an evil person may still find happiness so long as his evil deed does not bear fruit; but when his evil deed does bear fruit he will meet with evil consequences."
                },
                {
                    "verseNumber": 120,
                    "verseText": "Even a good person may still meet with suffering so long as his good deed does not bear fruit: but when it does bear fruit he will enjoy the benefits of his good deed."
                },
                {
                    "verseNumber": 121,
                    "verseText": "One should not think lightly of doing evil, imagining \"A little will not affect me\"; just as a water-jar is filled up by falling drops of rain, so also, the fool is filled up with evil, by accumulating it little by little."
                },
                {
                    "verseNumber": 122,
                    "verseText": "One should not think lightly of doing good, imagining 'A little will not affect me'; just as a water-jar is filled up by falling drops of rain, so also, the wise one is filled up with merit, by accumulating it little by little."
                },
                {
                    "verseNumber": 123,
                    "verseText": "Just as a wealthy merchant with few attendants avoids a dangerous road, just as one who desires to go on living avoids poison, so also, one should avoid evil."
                },
                {
                    "verseNumber": 124,
                    "verseText": "If there is no wound on the hand, one may handle poison; poison does not affect one who has no wound; there can be no evil for one who has no evil intention."
                },
                {
                    "verseNumber": 125,
                    "verseText": "If one wrongs a person who should not be wronged, one who is pure and is free from moral defilements, viz., an arahat, the evil falls back upon that fool, like fine dust thrown against the wind."
                },
                {
                    "verseNumber": 126,
                    "verseText": "Some are reborn as human beings, the wicked are reborn in a place of continuous torment (niraya). The righteous go to the deva world, and those who are free from moral intoxicants (viz., the arahats) realize Nibbana."
                },
                {
                    "verseNumber": 127,
                    "verseText": "Not in the sky, nor in the middle of the ocean, nor in the cave of a mountain, nor anywhere else, is there a place, where one may escape from the consequences of an evil deed."
                },
                {
                    "verseNumber": 128,
                    "verseText": "Not in the sky, nor in the middle of the ocean, nor in the cave of a mountain, nor anywhere else, is there a place where one cannot be oppressed by Death."
                }
            ]
        },
        {
            "chapterNumber": 10,
            "chapterTitle": "Punishment",
            "verses": [
                {
                    "verseNumber": 129,
                    "verseText": "All are afraid of the stick, all fear death. Putting oneself in another's place, one should not beat or kill others."
                },
                {
                    "verseNumber": 130,
                    "verseText": "All are afraid of the stick, all hold their lives dear. Putting oneself in another's place, one should not beat or kill others."
                },
                {
                    "verseNumber": 131,
                    "verseText": "He who seeks his own happiness by oppressing others, who also desire to have happiness, will not find happiness in his next existence."
                },
                {
                    "verseNumber": 132,
                    "verseText": "He who seeks his own happiness by not oppressing others, who also desire to have happiness, will find happiness in his next existence."
                },
                {
                    "verseNumber": 133,
                    "verseText": "Do not speak harshly to anyone; those who are thus spoken to will retort. Malicious talk is indeed the cause of trouble (dukkha) and retribution will come to you."
                },
                {
                    "verseNumber": 134,
                    "verseText": "If you can keep yourself calm and quiet like a broken gong which is no longer resonant, you are sure to realize Nibbana, there will be no harshness in you."
                },
                {
                    "verseNumber": 135,
                    "verseText": "As with a stick the cowherd drives his cattle to the pasture, so also, ageing and death drive the life of beings."
                },
                {
                    "verseNumber": 136,
                    "verseText": "A fool while doing evil deeds does not know them as being evil; but that fool suffers for his evil deeds like one who is burnt by fire."
                },
                {
                    "verseNumber": 137,
                    "verseText": "He who does harm with weapons to those who are harmless and should not be harmed will soon come to any of these ten evil consequences:"
                },
                {
                    "verseNumber": [138, 139, 140],
                    "verseText": "He will be subject to severe pain, or impoverishment, or injury to the body (i.e., loss of limbs), or serious illness (e.g., leprosy), or lunacy, or misfortunes following the wrath of the king, or wrongful and serious accusations, or loss of relatives, or destruction of wealth, or the burning down of his houses by fire or by lightning. After the dissolution of his body, the fool will be reborn in the plane of continuous suffering (niraya)."
                },
                {
                    "verseNumber": 141,
                    "verseText": "Not going naked, nor having matted hair, nor smearing oneself with mud, nor fasting, nor sleeping on bare ground, nor covering oneself with dust, nor striving by squatting can purify a being, who has not yet overcome doubt."
                },
                {
                    "verseNumber": 142,
                    "verseText": "Though he is gaily decked, if he is calm, free from moral defilements, and has his senses controlled, if he is established in Magga Insight, if he is pure and has laid aside enmity (lit., weapons) towards all beings, he indeed is a brahmana, a samana, and a bhikkhu."
                },
                {
                    "verseNumber": 143,
                    "verseText": "Rare in this world is the kind of person who out of a sense of shame restrains from doing evil and keeps himself awake like a good horse that gives no cause to be whipped."
                },
                {
                    "verseNumber": 144,
                    "verseText": "Like a good horse stirred at a touch of the whip, be diligent and get alarmed by endless round of rebirths (i.e., samsara). By faith, morality, effort, concentration, discernment of the Dhamma, be endowed with knowledge and practice of morality, and with mindfulness, leave this immeasurable dukkha (of samsara) behind."
                },
                {
                    "verseNumber": 145,
                    "verseText": "Farmers** channel the water; fletchers straighten the arrows; carpenters work the timber; the wise tame themselves."
                }
            ]
        },
        {
            "chapterNumber": 11,
            "chapterTitle": "Aging",
            "verses": [
                {
                    "verseNumber": 146,
                    "verseText": "Why is there laughter? Why is there joy although (the world) is always burning? Shrouded in darkness why not seek the light?"
                },
                {
                    "verseNumber": 147,
                    "verseText": "Look at this dressed up body, a mass of sores, supported (by bones), sickly, a subject of many thoughts (of sensual desire). Indeed, that body is neither permanent nor enduring."
                },
                {
                    "verseNumber": 148,
                    "verseText": "This body is worn out-with age, it is the seat of sickness, it is subject to decay. This putrid body disintegrates; life, indeed, ends in death."
                },
                {
                    "verseNumber": 149,
                    "verseText": "Like gourds thrown away in autumn are these dove-grey bones; what pleasure is there in seeing them?"
                },
                {
                    "verseNumber": 150,
                    "verseText": "This body (lit., the city) is built up with bones which are covered with flesh and blood; within this dwell (lit., are deposited) decay and death, pride and detraction (of others' virtues and reputation)."
                },
                {
                    "verseNumber": 151,
                    "verseText": "The much ornamented royal carriages do wear out, the body also grows old, but the Dhamma of the Virtuous does not decay. Thus, indeed, say the Virtuous among themselves."
                },
                {
                    "verseNumber": 152,
                    "verseText": "This man of little learning grows old like an ox; only his flesh grows but not his wisdom."
                },
                {
                    "verseNumber": 153,
                    "verseText": "I, who have been seeking the builder of this house (body), failing to attain Enlightenment (Bodhi nana or Sabbannuta nana) which would enable me to find him, have wandered through innumerable births in samsara. To be born again and again is, indeed, dukkha!"
                },
                {
                    "verseNumber": 154,
                    "verseText": "Oh house-builder! You are seen, you shall build no house (for me) again. All your rafters are broken, your roof-tree is destroyed. My mind has reached the unconditioned (i.e., Nibbana); the end of craving (Arahatta Phala) has been attained."
                },
                {
                    "verseNumber": 155,
                    "verseText": "They, who in youth have neither led the life of Purity nor have acquired wealth, waste away in dejection like decrepit herons on a drying pond deplete of fish."
                },
                {
                    "verseNumber": 156,
                    "verseText": "They, who in youth have neither led the Life of Purity nor have acquired wealth, lie helplessly like arrows that have lost momentum, moaning and sighing after the past."
                }
            ]
        },
        {
            "chapterNumber": 12,
            "chapterTitle": "Self",
            "verses": [
                {
                    "verseNumber": 157,
                    "verseText": "If one knows that one is dear to oneself, one should protect oneself well. During any of the three watches (of life) the wise man should be on guard (against evil)."
                },
                {
                    "verseNumber": 158,
                    "verseText": "One should first establish oneself in what is proper; then only one should teach others. A wise man should not incur reproach."
                },
                {
                    "verseNumber": 159,
                    "verseText": "One should act as one teaches others; only with oneself thoroughly tamed should one tame others. To tame oneself is, indeed, difficult."
                },
                {
                    "verseNumber": 160,
                    "verseText": "One indeed is one's own refuge; how can others be a refuge to one? With oneself thoroughly tamed, one can attain a refuge (i.e., Arahatta Phala), which is so difficult to attain."
                },
                {
                    "verseNumber": 161,
                    "verseText": "The evil done by oneself, arising in oneself, and caused by oneself, destroys the foolish one, just as a diamond grinds the rock from which it is formed."
                },
                {
                    "verseNumber": 162,
                    "verseText": "As the creeper (maluva) strangle the sal tree, so also, a really immoral person (overwhelmed by Craving) does to himself just what his enemy wishes him to do."
                },
                {
                    "verseNumber": 163,
                    "verseText": "It is easy to do things that are bad and unbeneficial to oneself, but it is, indeed, most difficult to do things that are beneficial and good."
                },
                {
                    "verseNumber": 164,
                    "verseText": "The foolish man who, on account of his wrong views, scorns the teaching of homage-worthy Noble Ones (Ariyas) who live according to the Dhamma is like the bamboo which bears fruit for its own destruction."
                },
                {
                    "verseNumber": 165,
                    "verseText": "By oneself indeed is evil done and by oneself is one defiled; by oneself is evil not done and by oneself is one purified. Purity and impurity depend entirely on oneself; no one can purify another."
                },
                {
                    "verseNumber": 166,
                    "verseText": "For the sake of another's benefit, however great it may be, do not neglect one's own (moral) benefit. Clearly perceiving one's own benefit one should make every effort to attain it."
                }
            ]
        },
        {
            "chapterNumber": 13,
            "chapterTitle": "The World",
            "verses": [
                {
                    "verseNumber": 167,
                    "verseText": "Do not follow ignoble ways, do not live in negligence, do not embrace wrong views, do not be the one to prolong samsara (lit., the world)."
                },
                {
                    "verseNumber": 168,
                    "verseText": "Do not neglect the duty of going on alms-round; observe proper practice (in going on alms-round). One who observes proper practice lives happily both in this world and in the next."
                },
                {
                    "verseNumber": 169,
                    "verseText": "Observe proper practice (in going on alms-round); do not observe improper practice. One who observes proper practice lives happily both in this world and in the next."
                },
                {
                    "verseNumber": 170,
                    "verseText": "If a man looks at the world (i.e., the five khandhas) in the same way as one looks at a bubble or a mirage, the King of Death will not find him."
                },
                {
                    "verseNumber": 171,
                    "verseText": "Come, look at this world (i.e., the five khandhas), which is like an ornamented royal carriage. Fools flounder in this world of the khandhas, but the wise are not attached to it."
                },
                {
                    "verseNumber": 172,
                    "verseText": "He, who has been formerly unmindful, but is mindful later on, lights up the world with the light of Magga Insight as does the moon freed from clouds."
                },
                {
                    "verseNumber": 173,
                    "verseText": "He who overwhelms with good the evil that he has done lights up this world (with the light of Magga Insight), as does the moon freed from clouds."
                },
                {
                    "verseNumber": 174,
                    "verseText": "Blind are the people of this world: only a few in this world see clearly (with Insight). Just as only a few birds escape from the net, so also, only a few get to the world of the devas, (and Nibbana)."
                },
                {
                    "verseNumber": 175,
                    "verseText": "Swans travel in the sky; those with supernormal powers travel through space; the wise having conquered Mara together with his army, go out of this world (i.e., realize Nibbana)."
                },
                {
                    "verseNumber": 176,
                    "verseText": "For one who transgresses the Truth, and is given to lying, and who is unconcerned with the life hereafter, there is no evil that he dare not do."
                },
                {
                    "verseNumber": 177,
                    "verseText": "Indeed, misers do not go to the abode of the devas; fools do not praise charity; but the wise rejoice in charity and so gain happiness in the life hereafter."
                },
                {
                    "verseNumber": 178,
                    "verseText": "Far better than sovereignty over the earth, or far better than going to the abodes of the devas, or far better than ruling supreme over the entire universe, is (the attainment of) Sotapatti Fruition."
                }
            ]
        },
        {
            "chapterNumber": 14,
            "chapterTitle": "The Buddha",
            "verses": [
                {
                    "verseNumber": 179,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 15,
            "chapterTitle": "Happiness",
            "verses": [
                {
                    "verseNumber": 197,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 16,
            "chapterTitle": "Affection",
            "verses": [
                {
                    "verseNumber": 209,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 17,
            "chapterTitle": "Anger",
            "verses": [
                {
                    "verseNumber": 221,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 18,
            "chapterTitle": "Impurities",
            "verses": [
                {
                    "verseNumber": 235,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 19,
            "chapterTitle": "The Just or the Righteous",
            "verses": [
                {
                    "verseNumber": 256,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 20,
            "chapterTitle": "The Path",
            "verses": [
                {
                    "verseNumber": 273,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 21,
            "chapterTitle": "Miscellaneous",
            "verses": [
                {
                    "verseNumber": 290,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 22,
            "chapterTitle": "Niraya",
            "verses": [
                {
                    "verseNumber": 306,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 23,
            "chapterTitle": "The Elephant",
            "verses": [
                {
                    "verseNumber": 320,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 24,
            "chapterTitle": "Craving",
            "verses": [
                {
                    "verseNumber": 334,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 25,
            "chapterTitle": "The Bhikkhus",
            "verses": [
                {
                    "verseNumber": 360,
                    "verseText": ""
                }
            ]
        },
        {
            "chapterNumber": 26,
            "chapterTitle": "The Brahmana",
            "verses": [
                {
                    "verseNumber": 383,
                    "verseText": ""
                }
            ]
        }
    ]
}